GComPI-IFPB/openmote-fw/platform/cc2650/inc/hw_ddi_0_osc.h
// Field: [16]    ALLOW_SCLK_HF_SWITCHING
//
// 0: Default - Switching of HF clock source is disabled .
// 1: Allows swtiching of sclk_hf source.
//
// Provided to prevent switching of the SCLK_HF source when running from flash
// (a long period during switching could corrupt flash). When sclk_hf  switching is
// disabled, a new source can be started when SCLK_HF_SRC_SEL is changed, but the
// switch will not occur until this bit is set.  This bit should be set to enable
// clock switching after STAT0.PENDINGSCLKHFSWITCHING indicates  the new HF clock
// is ready. When switching completes (also indicated by
// STAT0.PENDINGSCLKHFSWITCHING)  sclk_hf switching should be disabled to prevent
// flash corruption.  Switching should not be enabled when running from flash.
//
//
#define DDI_0_OSC_CTL0_ALLOW_SCLK_HF_SWITCHING                      0x00010000
#define DDI_0_OSC_CTL0_ALLOW_SCLK_HF_SWITCHING_BITN                 16
#define DDI_0_OSC_CTL0_ALLOW_SCLK_HF_SWITCHING_M                    0x00010000
#define DDI_0_OSC_CTL0_ALLOW_SCLK_HF_SWITCHING_S                    16

// Field: [14]    BAW_MODE_EN
//
// 0: Selects dtst_osc_clkin when OSC_DIG  is bypassed
// 1: Selects internal OSC_DIG _clk (RCOSC_HF or XOSC_HF derived 2 MHz)
#define DDI_0_OSC_CTL0_BAW_MODE_EN                                  0x00004000
#define DDI_0_OSC_CTL0_BAW_MODE_EN_BITN                             14
#define DDI_0_OSC_CTL0_BAW_MODE_EN_M                                0x00004000
#define DDI_0_OSC_CTL0_BAW_MODE_EN_S                                14

// Field: [12]    RCOSC_LF_TRIMMED
//
// Determines the accuracy at which RCOSC_LF_CLK is qualified. The RCOSC_LF_CLK is
// measured against the oscdig_clk (2MHz). This bit determines the acceptable ratio
// of  oscdig_clk periods per RCOSC_LF period.
//
// 0: RCOSC_LF_CLK is good if 6-200 2MHz periods per one RCOSC_LF period
// (intended for an untrimmed RCOSC_LF).
// 1: RCOSC_LF_CLK is good if 55-67 2MHz periods per one RCOSC_LF period
// (intended for a trimmed RCOSC_LF).
//
#define DDI_0_OSC_CTL0_RCOSC_LF_TRIMMED                             0x00001000
#define DDI_0_OSC_CTL0_RCOSC_LF_TRIMMED_BITN                        12
#define DDI_0_OSC_CTL0_RCOSC_LF_TRIMMED_M                           0x00001000
#define DDI_0_OSC_CTL0_RCOSC_LF_TRIMMED_S                           12

// Field: [11]    XOSC_HF_POWER_MODE
//
// XOSC/AMPCOMP mode.
//
// 0: High Power Mode (HPM)
// 1: Low Power Mode (LPM)
//
// Sets the XOSC_HF Power mode. If in the HPM_UPDATE (LPM_UPDATE)  state, the
// AMPCOMP FSM will transition to the (HPM_UPDATE) LPM_UPDATE state when this bit is
// set to a '1' ('0). If set to LPM when the XOSC_HF is started, the XOSC_HF will
// startup in High-Power Mode then transition to Low-Power Mode. STAT1.RAMPSTATE
// indicates the current FSM State. It can be polled to see that a transtion to the
// desired power mode has completed.
//
// Note well that XOSC_HF settings in AMPCOMPCTL, RADCEXTCFG,
// AMPCOMPTH1, and AMPCOMPTH2 must be set correctly, and are usually set by
// FW.
#define DDI_0_OSC_CTL0_XOSC_HF_POWER_MODE                           0x00000800
#define DDI_0_OSC_CTL0_XOSC_HF_POWER_MODE_BITN                      11
#define DDI_0_OSC_CTL0_XOSC_HF_POWER_MODE_M                         0x00000800
#define DDI_0_OSC_CTL0_XOSC_HF_POWER_MODE_S                         11

// Field: [10]    XOSC_LF_DIG_BYPASS
//
// Bypass XOSC_LF and use the digital input clock from AON for the xosc_lf clock..
//
// 0: Use 32kHz XOSC as xosc_lf clock source
// 1: Use digital input (from AON) as xosc_lf clock source.
//
// This bit will only have effect when SCLK_LF_SRC_SEL is selecting the
// xosc_lf as the sclk_lf source. The muxing performed by this bit is not glitch
// free. The following procedure should be followed when changing this field to
// avoid glitches on sclk_lf..
//
// 1) Set SCLK_LF_SRC_SEL to select any source other than the xosc_lf clock
// source.
// 2) Set or clear this bit to bypass or not bypass the xosc_lf.
// 3) Set SCLK_LF_SRC_SEL to use xosc_lf.
//
// It is recommended that either the rcosc_hf or xosc_hf (whichever is currently
// active) be selected as the source in step 1 above. This provides a faster clock
// change.
#define DDI_0_OSC_CTL0_XOSC_LF_DIG_BYPASS                           0x00000400
#define DDI_0_OSC_CTL0_XOSC_LF_DIG_BYPASS_BITN                      10
#define DDI_0_OSC_CTL0_XOSC_LF_DIG_BYPASS_M                         0x00000400
#define DDI_0_OSC_CTL0_XOSC_LF_DIG_BYPASS_S                         10

// Field: [9]    CLK_LOSS_EN
//
// Enable clock loss circuit and hence the indicators to system controller.  Checks
// both SCLK_HF and SCLK_LF clock loss indicators.
//
// 0: Disable
// 1: Enable
//
// Clock loss detection should be disabled when changing the sclk_lf source.
// STAT0.SCLK_LF_SRC can be polled to determine when a change to a new sclk_lf
// source has completed.
#define DDI_0_OSC_CTL0_CLK_LOSS_EN                                  0x00000200
#define DDI_0_OSC_CTL0_CLK_LOSS_EN_BITN                             9
#define DDI_0_OSC_CTL0_CLK_LOSS_EN_M                                0x00000200
#define DDI_0_OSC_CTL0_CLK_LOSS_EN_S                                9

// Field: [8:7] ACLK_TDC_SRC_SEL
//
// Source select for aclk_tdc.
//
// 00: rcosc_hf_clk
// 01: rcosc_hf_d24m_clk
// 10: xosc_hf_d24m_clk
// 11: Not valid
#define DDI_0_OSC_CTL0_ACLK_TDC_SRC_SEL_M                           0x00000180
#define DDI_0_OSC_CTL0_ACLK_TDC_SRC_SEL_S                           7

// Field: [6:5] ACLK_REF_SRC_SEL
//
// Source select for aclk_ref
//
// 00: rcosc_hf_dlf_clk
// 01: xosc_hf_dlf_clk
// 10: rcosc_lf_clk
// 11: xosc_lf_clk
#define DDI_0_OSC_CTL0_ACLK_REF_SRC_SEL_M                           0x00000060
#define DDI_0_OSC_CTL0_ACLK_REF_SRC_SEL_S                           5

// Field: [3:2] SCLK_LF_SRC_SEL
//
// Source select for sclk_lf
// ENUMs:
// RCOSCHFDLF           rcosc_hf_dlf_clk.
// Low frequency clock derived from High Frequency RCOSC
// XOSCHFDLF            xosc_hf_dlf_clk.
// Low frequency clock derived from High Frequency XOSC
// RCOSCLF              rcosc_lf_clk
// Low frequency RCOSC
// XOSCLF               xosc_lf_clk
// Low frequency XOSC
//
#define DDI_0_OSC_CTL0_SCLK_LF_SRC_SEL_M                            0x0000000C
#define DDI_0_OSC_CTL0_SCLK_LF_SRC_SEL_S                            2
#define DDI_0_OSC_CTL0_SCLK_LF_SRC_SEL_RCOSCHFDLF                   0x00000000
#define DDI_0_OSC_CTL0_SCLK_LF_SRC_SEL_XOSCHFDLF                    0x00000004
#define DDI_0_OSC_CTL0_SCLK_LF_SRC_SEL_RCOSCLF                      0x00000008
#define DDI_0_OSC_CTL0_SCLK_LF_SRC_SEL_XOSCLF                       0x0000000C

// Field: [1]    SCLK_MF_SRC_SEL
//
// Source select for sclk_mf
// ENUMs:
// RCOSCHFDMF           rcosc_hf_dmf_clk
// Medium frequency clock derived from high frequency RCOSC
// XCOSCHFDMF           xosc_hf_dmf_clk
// Medium frequency clock derived from high frequency XOSC or BAW.
//
#define DDI_0_OSC_CTL0_SCLK_MF_SRC_SEL                              0x00000002
#define DDI_0_OSC_CTL0_SCLK_MF_SRC_SEL_BITN                         1
#define DDI_0_OSC_CTL0_SCLK_MF_SRC_SEL_M                            0x00000002
#define DDI_0_OSC_CTL0_SCLK_MF_SRC_SEL_S                            1
#define DDI_0_OSC_CTL0_SCLK_MF_SRC_SEL_RCOSCHFDMF                   0x00000000
#define DDI_0_OSC_CTL0_SCLK_MF_SRC_SEL_XCOSCHFDMF                   0x00000002

