GComPI-IFPB/openmote-fw/platform/cc2650/inc/hw_ddi_0_osc.h
// Field: [1]    DDI_RADC_CLRZ
//
// Active low clrz for RADC_DIG.
//
// 0: Reset digital logic in the RADC.
// 1: Release reset of digital logic in RADC.
//
// Used when RADC_EXTERNAL_USE_EN = 1.
#define DDI_0_OSC_RADCEXTCFG_DDI_RADC_CLRZ                          0x00000002
#define DDI_0_OSC_RADCEXTCFG_DDI_RADC_CLRZ_BITN                     1
#define DDI_0_OSC_RADCEXTCFG_DDI_RADC_CLRZ_M                        0x00000002
#define DDI_0_OSC_RADCEXTCFG_DDI_RADC_CLRZ_S                        1

//*****************************************************************************
//
// Register: DDI_0_OSC_O_AMPCOMPCTL
//
//*****************************************************************************
// Field: [30]    AMPCOMP_REQ_MODE
//
// RADC mode during ampcomp_req from AON. FSM forces ADC to be in selected mode
// during ampcomp request (during amplitude maintainance).
//
// 0: Comparator
// 1: 1-time SAR mode
//
// This bit is not used during the ramping up or transitioning from one mode to
// other.
#define DDI_0_OSC_AMPCOMPCTL_AMPCOMP_REQ_MODE                       0x40000000
#define DDI_0_OSC_AMPCOMPCTL_AMPCOMP_REQ_MODE_BITN                  30
#define DDI_0_OSC_AMPCOMPCTL_AMPCOMP_REQ_MODE_M                     0x40000000
#define DDI_0_OSC_AMPCOMPCTL_AMPCOMP_REQ_MODE_S                     30

// Field: [29:28] AMPCOMP_FSM_UPDATE_RATE
//
// Run all XOSC input updates at 2M/1M/500K/250K.
//
// 00: 2 MHz
// 01: 1 MHz
// 10: 500KHz
// 11: 250KHz
// ENUMs:
// 2MHZ                 2 MHz ampcomp rate
// 1MHZ                 1 MHz ampcomp rate
// 500KHZ               500 kHz ampcomp rate
// 250KHZ               250 kHz ampcomp rate
//
#define DDI_0_OSC_AMPCOMPCTL_AMPCOMP_FSM_UPDATE_RATE_M              0x30000000
#define DDI_0_OSC_AMPCOMPCTL_AMPCOMP_FSM_UPDATE_RATE_S              28
#define DDI_0_OSC_AMPCOMPCTL_AMPCOMP_FSM_UPDATE_RATE_2MHZ           0x00000000
#define DDI_0_OSC_AMPCOMPCTL_AMPCOMP_FSM_UPDATE_RATE_1MHZ           0x10000000
#define DDI_0_OSC_AMPCOMPCTL_AMPCOMP_FSM_UPDATE_RATE_500KHZ         0x20000000
#define DDI_0_OSC_AMPCOMPCTL_AMPCOMP_FSM_UPDATE_RATE_250KHZ         0x30000000

// Field: [27]    AMPCOMP_SW_CTRL
//
// 0: OSC_DIG HW controls enabled amplitude compensation.
// 1: Give control to the software. SW is now responsible for start of ampcomp
// fsm.  Requires that AMPCOMP_SW_EN = 1.
#define DDI_0_OSC_AMPCOMPCTL_AMPCOMP_SW_CTRL                        0x08000000
#define DDI_0_OSC_AMPCOMPCTL_AMPCOMP_SW_CTRL_BITN                   27
#define DDI_0_OSC_AMPCOMPCTL_AMPCOMP_SW_CTRL_M                      0x08000000
#define DDI_0_OSC_AMPCOMPCTL_AMPCOMP_SW_CTRL_S                      27

// Field: [26]    AMPCOMP_SW_EN
//
// 0: Default
// 1: Starts ampcomp FSM
//
// Used when AMPCOMP_SW_CTRL = 1.
#define DDI_0_OSC_AMPCOMPCTL_AMPCOMP_SW_EN                          0x04000000
#define DDI_0_OSC_AMPCOMPCTL_AMPCOMP_SW_EN_BITN                     26
#define DDI_0_OSC_AMPCOMPCTL_AMPCOMP_SW_EN_M                        0x04000000
#define DDI_0_OSC_AMPCOMPCTL_AMPCOMP_SW_EN_S                        26

// Field: [25]    XOSC_HF_HP_BUF_SW_CTRL
//
// This field give SW control of the enabling of the XOSC_HF or BAW clock to the
// synth.
//
// 0: OSC_DIG  HW controls enabling the clock buffer to the synthesizer.
// 1: SW control enabling the clock buffer to the synthesizer.
//
// If this field = 1,. then XOSC_HF_HP_BUF_SW_EN  enables/disables the clock
// to the synthesizer. The user may find this useful if the synth clock is generated
// externally by a TXO on X48P pin.
#define DDI_0_OSC_AMPCOMPCTL_XOSC_HF_HP_BUF_SW_CTRL                 0x02000000
#define DDI_0_OSC_AMPCOMPCTL_XOSC_HF_HP_BUF_SW_CTRL_BITN            25
#define DDI_0_OSC_AMPCOMPCTL_XOSC_HF_HP_BUF_SW_CTRL_M               0x02000000
#define DDI_0_OSC_AMPCOMPCTL_XOSC_HF_HP_BUF_SW_CTRL_S               25

// Field: [24]    XOSC_HF_HP_BUF_SW_EN
//
// If XOSC_HF_HP_BUF_SW_CTRL = 0, then this bit has no effect.
//
// If XOSC_HF_HP_BUF_SW_CTRL = 1, this field controls the enable of the clock
// to the synthesizer.
//
// 0: Disable clock to the synthesizer.
// 1: Enable clock to the synthesizer.
//
// In XOSC_HF mode, this field activates the "high power" buffer in the XOSC_HF
// module to drive the clock to the synthesizer.
// In BAW mode, this field activates the BAW Clock Good signal to the BAW Module
// which enables the clock buffer that drives the clock to the synthesizer.
//
// The user may find this useful if the synth clock is generated externally by a
// TXO on X48P pin.
//
//
#define DDI_0_OSC_AMPCOMPCTL_XOSC_HF_HP_BUF_SW_EN                   0x01000000
#define DDI_0_OSC_AMPCOMPCTL_XOSC_HF_HP_BUF_SW_EN_BITN              24
#define DDI_0_OSC_AMPCOMPCTL_XOSC_HF_HP_BUF_SW_EN_M                 0x01000000
#define DDI_0_OSC_AMPCOMPCTL_XOSC_HF_HP_BUF_SW_EN_S                 24

// Field: [23:20] IBIAS_OFFSET
//
// Offset (minimum) value of XOSC IBIAS trim.
// IBIAS trim value would always be greater than or equal to this offset in both
// HPM and LPM. The value is an unsigned integer. The setting is XTAL dependent and
// set by FW.
#define DDI_0_OSC_AMPCOMPCTL_IBIAS_OFFSET_M                         0x00F00000
#define DDI_0_OSC_AMPCOMPCTL_IBIAS_OFFSET_S                         20

// Field: [19:16] IBIAS_INIT
//
// Value of XOSC IBIAS trim above the IBIAS_OFFSET for HPM. During ramp-up, IBIAS
// trim is set initially to the max value and then decreased to IBIAS_OFFSET +
// IBIAS_INIT on the way to HPM_UPDATE. The value is an unsigned integer. The
// setting is XTAL dependent and set by FW.
#define DDI_0_OSC_AMPCOMPCTL_IBIAS_INIT_M                           0x000F0000
#define DDI_0_OSC_AMPCOMPCTL_IBIAS_INIT_S                           16

// Field: [15:8] LPM_IBIAS_WAIT_CNT_FINAL
//
// FSM waits for LPM_IBIAS_WAIT_CNT_FINAL clock cycles in the
// IDAC_DECREMENT_WITH_MEASURE state in order to compensate slow response of the
// xtal. The value is an unsigned integer. The setting is XTAL dependent and set by
// FW.
#define DDI_0_OSC_AMPCOMPCTL_LPM_IBIAS_WAIT_CNT_FINAL_M             0x0000FF00
#define DDI_0_OSC_AMPCOMPCTL_LPM_IBIAS_WAIT_CNT_FINAL_S             8

// Field: [7:4] CAP_STEP
//
// Step size of XOSC capasitor trim (both Q1 and Q2) during XOSC mode transition.
// Can vary from 6 to 12. Other values are possible but not valid. The value is an
// unsigned integer. The setting is XTAL dependent and set by FW.
#define DDI_0_OSC_AMPCOMPCTL_CAP_STEP_M                             0x000000F0
#define DDI_0_OSC_AMPCOMPCTL_CAP_STEP_S                             4

