GComPI-IFPB/openmote-fw/platform/cc2650/inc/hw_ddi_0_osc.h
// Field: [3:0] IBIASCAP_HPTOLP_OL_CNT
//
// During a HPM to LPM transition a HW loop is entered that modifies cap, ibias and
// iDAC trims. This field sets the number of loop iterations. In each iteration the
// cap trim is decremented CAP_STEP times, then the iDAC trim is incremented
// RADCEXTCFG.IDAC_STEP times, and finally the ibias trim is decremented by 1.
// After IBIASCAP_HPTOLP_OL_CNT iterations, the cap trim is decremented to 0 (if
// greater than 0) and the iDAC trim is incremented to 96 (if less than 96). The
// setting of this field is XTAL dependant and set by FW.
//
#define DDI_0_OSC_AMPCOMPCTL_IBIASCAP_HPTOLP_OL_CNT_M               0x0000000F
#define DDI_0_OSC_AMPCOMPCTL_IBIASCAP_HPTOLP_OL_CNT_S               0

//*****************************************************************************
//
// Register: DDI_0_OSC_O_AMPCOMPTH1
//
//*****************************************************************************
// Field: [23:18] HPMRAMP3_LTH
//
// HPM Ramp3 low amplitude threshhold.
//
// In HPM_UPDATE, if amplitude < HPMRAMP3_LTH increase iDAC trim, unless max
// trim has been reached.
//
// In IDAC_DECREMENT_WITH_MEASURE, exit the state if amplitude < HPMRAMP3_LTH.
//
// The value is an unsigned integer.
// The settiing is XTAL dependent and set by FW.
#define DDI_0_OSC_AMPCOMPTH1_HPMRAMP3_LTH_M                         0x00FC0000
#define DDI_0_OSC_AMPCOMPTH1_HPMRAMP3_LTH_S                         18

// Field: [15:10] HPMRAMP3_HTH
//
// In HPM_RAMP3, if amp < HPMRAMP3_HTH then move to HPM_UPDATE.
//
// In HPM_UPDATE, if amplitude > HPMRAMP3_HTH decrease iDAC trim, unless min
// trim has been reached.
//
// In IDAC_DECREMENT_WITH_MEASURE, exit the state if amplitude < HPMRAMP3_HTH.
//
//
// The value is an unsigned integer.
// The settiing is XTAL dependent and set by FW.
#define DDI_0_OSC_AMPCOMPTH1_HPMRAMP3_HTH_M                         0x0000FC00
#define DDI_0_OSC_AMPCOMPTH1_HPMRAMP3_HTH_S                         10

// Field: [9:6] IBIASCAP_LPTOHP_OL_CNT
//
// During a LPM to HPM transition a HW loop is entered that modifies cap, and ibias
// trims. This field sets the number of loop iterations. In each iteration the cap
// trim is incremented AMPCOMPCTL.CAP_STEP times, then the ibias trim is
// decremented once.  After IBIASCAP_LPTOHP_OL_CNT iterations, the cap trim is
// incremented until the trim is equal to the setting defined by
// ANABYPASSVAL1.XOSC_HF_ROW_Q12 and ANABYPASSVAL1.XOSC_HF_COLUMN_Q12.
//
// The value is an unsigned integer.
// The settiing is XTAL dependent and set by FW.
//
//
//
#define DDI_0_OSC_AMPCOMPTH1_IBIASCAP_LPTOHP_OL_CNT_M               0x000003C0
#define DDI_0_OSC_AMPCOMPTH1_IBIASCAP_LPTOHP_OL_CNT_S               6

// Field: [5:0] HPMRAMP1_TH
//
// HPM Ramp1 amplitude threshhold.
// Wait in HPM_RAMP1 until amplitude > HPMRAMP1_TH.
//
// The value is an unsigned integer.
// The settiing is XTAL dependent and set by FW.
//
// The XOSCHF clock to the synth will be released after the amplitude of XOSC_HF
// passes HPMRAMP1_TH, as is the DOUBLER clock.
#define DDI_0_OSC_AMPCOMPTH1_HPMRAMP1_TH_M                          0x0000003F
#define DDI_0_OSC_AMPCOMPTH1_HPMRAMP1_TH_S                          0

//*****************************************************************************
//
// Register: DDI_0_OSC_O_AMPCOMPTH2
//
//*****************************************************************************
// Field: [31:26] LPMUPDATE_LTH
//
// LPM Update low amplitude threshhold when RADC is in SAR mode.
//
// In the LPM_UPDATE state and RADC is in SAR Mode, increment iDAC trim (unless
// at max) if amplitude < LPMUPDATE_LTH.
//
// The value is an unsigned integer.
// The settiing is XTAL dependent and set by FW.
//
#define DDI_0_OSC_AMPCOMPTH2_LPMUPDATE_LTH_M                        0xFC000000
#define DDI_0_OSC_AMPCOMPTH2_LPMUPDATE_LTH_S                        26

// Field: [23:18] LPMUPDATE_HTH
//
// LPM update high amplitude threshhold when RADC is in SAR mode.
//
// In the LPM_UPDATE state  and RADC is in SAR Mode, decrement iDAC trim (unless
// at min) if amplitude > LPMUPDATE_HTH.
//
// The value is an unsigned integer.
// The settiing is XTAL dependent and set by FW.
#define DDI_0_OSC_AMPCOMPTH2_LPMUPDATE_HTH_M                        0x00FC0000
#define DDI_0_OSC_AMPCOMPTH2_LPMUPDATE_HTH_S                        18

// Field: [15:10] ADC_COMP_AMPTH_LPM
//
// Low Power Mode Amplitude Threshold for Comparator mode.
// When ADC is in comparator mode, this field sets the amplitude threshold used
// during the LPM_UPDATE state (Low Power Mode amplitude maintenance).  The xosc_hf
// amplitude is periodically compared against the threshold. The iDAC bias is
// decremented if the amplitude is greater than the threshold, otherwise it is
// incremented.
//
// The value is an unsigned integer.
// The settiing is XTAL dependent and set by FW.
#define DDI_0_OSC_AMPCOMPTH2_ADC_COMP_AMPTH_LPM_M                   0x0000FC00
#define DDI_0_OSC_AMPCOMPTH2_ADC_COMP_AMPTH_LPM_S                   10

// Field: [7:2] ADC_COMP_AMPTH_HPM
//
// High Power Mode Amplitude Threshold for Comparator mode.
// When ADC is in comparator mode, this field sets the amplitude threshold used
// during the HPM_UPDATE state (High Power Mode amplitude maintenance).  The xosc_hf
// amplitude is periodically compared against the threshold. The iDAC bias is
// decremented if the amplitude is greater than the threshold, otherwise it is
// incremented.
//
// The value is an unsigned integer.
// The settiing is XTAL dependent and set by FW.
#define DDI_0_OSC_AMPCOMPTH2_ADC_COMP_AMPTH_HPM_M                   0x000000FC
#define DDI_0_OSC_AMPCOMPTH2_ADC_COMP_AMPTH_HPM_S                   2

//*****************************************************************************
//
// Register: DDI_0_OSC_O_ANABYPASSVAL1
//
//*****************************************************************************
// Field: [19:16] XOSC_HF_ROW_Q12
//
// This field is used whether or not OSC_DIG  is bypassed.
//
// When OSC_DIG  is not bypassed this setting determines the cap_init_row value
// used in the High-Power Mode.
//
// This value is XTAL dependent and set by FW.
//
// When OSC_DIG  is bypassed this setting determines the xosc_hf capacitor bank
// row value
//
// The xosc_hf capacitor bank uses a row/column encoding. The row value is a
// thermometer encoded.
#define DDI_0_OSC_ANABYPASSVAL1_XOSC_HF_ROW_Q12_M                   0x000F0000
#define DDI_0_OSC_ANABYPASSVAL1_XOSC_HF_ROW_Q12_S                   16

// Field: [15:0] XOSC_HF_COLUMN_Q12
//
// This field is used whether or not OSC_DIG  is bypassed.
//
// When OSC_DIG  is not bypassed this setting determines the cap_init_column
// value used in HPM.
//
// This value is XTAL dependent and set by FW.
//
// When OSC_DIG  is bypassed this setting determines the target xosc_hf
// capacitor bank column value.
//
// The xosc_hf capacitor bank uses a row/column encoding. The column value is a
// thermometer encoded.
#define DDI_0_OSC_ANABYPASSVAL1_XOSC_HF_COLUMN_Q12_M                0x0000FFFF
#define DDI_0_OSC_ANABYPASSVAL1_XOSC_HF_COLUMN_Q12_S                0

//*****************************************************************************
//
// Register: DDI_0_OSC_O_ANABYPASSVAL2
//
//*****************************************************************************
// Field: [13:0] XOSC_HF_IBIASTHERM
//
// Internal Register. Customers can control this through TI provided API
#define DDI_0_OSC_ANABYPASSVAL2_XOSC_HF_IBIASTHERM_M                0x00003FFF
#define DDI_0_OSC_ANABYPASSVAL2_XOSC_HF_IBIASTHERM_S                0

//*****************************************************************************
//
// Register: DDI_0_OSC_O_ATESTCTL
//
//*****************************************************************************
// Field: [29]    SCLK_LF_AUX_EN
//
// Enable 32 kHz clock to SOC_AUX.
//
//
#define DDI_0_OSC_ATESTCTL_SCLK_LF_AUX_EN                           0x20000000
#define DDI_0_OSC_ATESTCTL_SCLK_LF_AUX_EN_BITN                      29
#define DDI_0_OSC_ATESTCTL_SCLK_LF_AUX_EN_M                         0x20000000
#define DDI_0_OSC_ATESTCTL_SCLK_LF_AUX_EN_S                         29

// Field: [28:20] ATEST_OSC_CTRL
//
// Select lines for top-level OSC_TOP ATEST mux. There are two outputs (ATEST1 and
// ATEST0)  and each has an independently controlled mux. The muxes use a one-hot
// encoding.
//
// Bits 23:20 select the source for the ATEST0 output as follows:
// 0x0: Not driven
// 0x1: OSCLFANA to ATEST0
// 0x2: OSCHFANA to ATEST0
// 0x4: RADC to ATEST0
// 0x8: Doubler to ATEST0
//
// Bits 28:24 select the source for the ATEST1 output as follows:
// 0x00: Not driven
// 0x01: OSCLFCLK to ATEST1  (output from OSCLF lower-level mux.
// ATESTLF_OSC_1P2V controls the lower-level mux)
// 0x02: OSCHFCLK to ATEST1 (ATEST_OSC_HF_SEL)
// 0x04: RADC to ATEST1
// 0x08: Doubler to ATEST1
// 0x10: Doubler clock to ATEST1
//
// ATEST is intended for debug and characterization. Programming ATEST correctly
// requires that paths are setup in the correct order. Incorrectly programmed paths
// can short signals together or to ground.
//
// A higher level of muxing (between OSC_TOP and other analog modules) and
// enabling exists and is controlled by ADI_4_AUX:ATEST. See the ATEST Design
// Memo for details.
//
//
#define DDI_0_OSC_ATESTCTL_ATEST_OSC_CTRL_M                         0x1FF00000
#define DDI_0_OSC_ATESTCTL_ATEST_OSC_CTRL_S                         20

// Field: [19:16] ATEST_OSC_HF_SEL
//
// Selects the source for high frequency oscillator test outputs.  Note, does not
// control muxing of BAW related test signals.  These are controled by
// ATESTLF_OSC_1P2V and ATESTLF_OSC_1P8V.
// Controls two test outputs ATEST_OSCHF_CLCKOUT_1P8V and ATEST_OSCHF_ANA_OUT.
//
// 0x0:
// ATEST_OSCHF_CLKOUT_1P8V is XOSC_HF LP clock output.
// ATEST_OSCHF_ANA_OUT is Not Driven.
//
// 0x1:
// ATEST_OSCHF_CLKOUT_1P8V is Not Driven.
// ATEST_OSCHF_ANA_OUT is XOSC_HF ATEST0 output.
//
// 0x2:
// ATEST_OSCHF_CLKOUT_1P8V is RCOSC_HF clock output.
// ATEST_OSCHF_ANA_OUT is Not Driven.
//
// 0x3:
// ATEST_OSCHF_CLKOUT_1P8V is RCOSC_HF clock output.
// ATEST_OSCHF_ANA_OUT is RCOSC_HF ATEST0 output.
//
// 0x4:
// ATEST_OSCHF_CLKOUT_1P8V is XOSC_HF HP clock output
// ATEST_OSCHF_ANA_OUT is Not Driven
//
// 0x5:
// ATEST_OSCHF_CLKOUT_1P8V is XOSC_HF HP clock output
// ATEST_OSCHF_ANA_OUT is XOSC ATEST0 output
//
//
#define DDI_0_OSC_ATESTCTL_ATEST_OSC_HF_SEL_M                       0x000F0000
#define DDI_0_OSC_ATESTCTL_ATEST_OSC_HF_SEL_S                       16

