GComPI-IFPB/openmote-fw/platform/cc2650/inc/hw_ddi_0_osc.h
// Field: [4:2] HP_BUF_ITRIM
//
// Adjust Ibias trim for HP buffer.
//
// 0x4: Min (16 uA)
// 0x0: Default (64 uA)
// 0x3: Max (128 uA)
//
// This field uses a 2's complement encoding.
// This value is XTAL dependent and set by FW.
//
//
#define DDI_0_OSC_XOSCHFCTL_HP_BUF_ITRIM_M                          0x0000001C
#define DDI_0_OSC_XOSCHFCTL_HP_BUF_ITRIM_S                          2

// Field: [1:0] LP_BUF_ITRIM
//
// Adjust Ibias trim for LP buffer.
//
// 01: Min (700 nA)
// 00: Default (900 nA)
// 11: 1 step up (1.1 uA)
// 10: Max (2.0 uA)
//
// This value is XTAL dependent and set by FW
//
#define DDI_0_OSC_XOSCHFCTL_LP_BUF_ITRIM_M                          0x00000003
#define DDI_0_OSC_XOSCHFCTL_LP_BUF_ITRIM_S                          0

//*****************************************************************************
//
// Register: DDI_0_OSC_O_LFOSCCTL
//
//*****************************************************************************
// Field: [26]    XOSCLF_BUFFER_TRIM
//
// Set high to double current mirror ratio in XOSCLF_LPBUFF (from 25 nA to 50 nA).
// Not normally used.
//
//
#define DDI_0_OSC_LFOSCCTL_XOSCLF_BUFFER_TRIM                       0x04000000
#define DDI_0_OSC_LFOSCCTL_XOSCLF_BUFFER_TRIM_BITN                  26
#define DDI_0_OSC_LFOSCCTL_XOSCLF_BUFFER_TRIM_M                     0x04000000
#define DDI_0_OSC_LFOSCCTL_XOSCLF_BUFFER_TRIM_S                     26

// Field: [25]    XOSCLF_TESTMUX_EN
//
// This enables ATEST0 and ATEST1 outputs from xosclf.
//
// 0: Diable (Default)
// 1: Enable
//
// This must be active to see the xosc_lf clock if it is selected by
// ATESTCTL.ATESTLF_OSC_1P2V onto ATEST1.
//
// This must be active to see the xosc_lf core regulator bias current on ATEST0.
//
//
#define DDI_0_OSC_LFOSCCTL_XOSCLF_TESTMUX_EN                        0x02000000
#define DDI_0_OSC_LFOSCCTL_XOSCLF_TESTMUX_EN_BITN                   25
#define DDI_0_OSC_LFOSCCTL_XOSCLF_TESTMUX_EN_M                      0x02000000
#define DDI_0_OSC_LFOSCCTL_XOSCLF_TESTMUX_EN_S                      25

// Field: [23:22] XOSCLF_REGULATOR_TRIM
//
// Trims resistor in constant gm bias
//
// 00: Default (225 k),
// 10: Min (425k),
// 01: Max (125k),
// 11: 1 step more than min (325k)
//
// This value is XTAL dependent and set by FW.
//
//
#define DDI_0_OSC_LFOSCCTL_XOSCLF_REGULATOR_TRIM_M                  0x00C00000
#define DDI_0_OSC_LFOSCCTL_XOSCLF_REGULATOR_TRIM_S                  22

// Field: [21:18] XOSCLF_CMIRRWR_RATIO
//
// Adjust current mirror ratio into osc core
//
// 0x8: Min
// 0x0: Default
// 0x7: Max
//
// This field uses a 2's complement encoding.
// This value is XTAL dependent and set by FW
//
//
#define DDI_0_OSC_LFOSCCTL_XOSCLF_CMIRRWR_RATIO_M                   0x003C0000
#define DDI_0_OSC_LFOSCCTL_XOSCLF_CMIRRWR_RATIO_S                   18

// Field: [17]    XOSCLF_ANA_AMP_CTRL
//
// Disables analog amplitude control
//
// 0: Enabled
// 1: Disabled
//
#define DDI_0_OSC_LFOSCCTL_XOSCLF_ANA_AMP_CTRL                      0x00020000
#define DDI_0_OSC_LFOSCCTL_XOSCLF_ANA_AMP_CTRL_BITN                 17
#define DDI_0_OSC_LFOSCCTL_XOSCLF_ANA_AMP_CTRL_M                    0x00020000
#define DDI_0_OSC_LFOSCCTL_XOSCLF_ANA_AMP_CTRL_S                    17

// Field: [16]    XOSCLF_RXTX_MODE
//
// Enables xosc_lf high-power buffer and disables the low-power-buffer.
//
// The high-power buffer provides better phase-noise but the use model doesn't
// require high performance of the xosc_lf.
//
// If the xosc_lf XTAL is not populated, an external clock can be driven on the
// xosc_lf_q1 pin to provide an external 32KHz source. This bit must be set to '1'
// to use this method. I.e. the external source must pass throught the xosc_lf
// high-power buffer.
//
// Note: This is a different method of providing a 32KHz external clock than the
// method enabled by CTL0.XOSC_LF_DIG_BYPASS
//
// The low power buffer is the buffer of choice and the use-model is that it is
// on whenever the xosc_lf is used. The high-power buffer is only expected to be
// used for the external clock.
//
//
#define DDI_0_OSC_LFOSCCTL_XOSCLF_RXTX_MODE                         0x00010000
#define DDI_0_OSC_LFOSCCTL_XOSCLF_RXTX_MODE_BITN                    16
#define DDI_0_OSC_LFOSCCTL_XOSCLF_RXTX_MODE_M                       0x00010000
#define DDI_0_OSC_LFOSCCTL_XOSCLF_RXTX_MODE_S                       16

// Field: [11]    RCOSCLF_VDD_LOCAL_TRIM
//
// Not used.
//
//
#define DDI_0_OSC_LFOSCCTL_RCOSCLF_VDD_LOCAL_TRIM                   0x00000800
#define DDI_0_OSC_LFOSCCTL_RCOSCLF_VDD_LOCAL_TRIM_BITN              11
#define DDI_0_OSC_LFOSCCTL_RCOSCLF_VDD_LOCAL_TRIM_M                 0x00000800
#define DDI_0_OSC_LFOSCCTL_RCOSCLF_VDD_LOCAL_TRIM_S                 11

// Field: [10]    RCOSCLF_LOCAL_ATEST_EN
//
// Enable RCOSC_LF ATEST Outputs
//
// 0: RCOSC_LF ATEST outputs disabled
// 1: RCOSC_LF ATEST outputs enabled.
//
// When enabled, the RCOSC_LF 0P7V local supply and the RCOSC_LF clock can be
// connected to drive ATEST0 and ATEST1 (respectively).
//
// This enable causes the RCOSC_LF to drive the ATEST signals to muxes that do
// further selection. One mux selects the clock on ATEST1 and it is controled by
// ATESTCTL.ATESTLF_OSC_1P2V. The other mux selects the data and is controlled by
// ATESTCTL.ATESTLF_OSC_1P8V.
//
// To drive these signals further on to the ATEST outputs, these muxes must be
// programmed to select these inputs.
//
//
#define DDI_0_OSC_LFOSCCTL_RCOSCLF_LOCAL_ATEST_EN                   0x00000400
#define DDI_0_OSC_LFOSCCTL_RCOSCLF_LOCAL_ATEST_EN_BITN              10
#define DDI_0_OSC_LFOSCCTL_RCOSCLF_LOCAL_ATEST_EN_M                 0x00000400
#define DDI_0_OSC_LFOSCCTL_RCOSCLF_LOCAL_ATEST_EN_S                 10

// Field: [9:8] RCOSCLF_RTUNE_TRIM
//
// Trims the resistance in the RC 32 kHz osc to tune the osc frequency.
//
//
// ENUMs:
// 7P5MEG               7.5 MOhm (Default)
// 7P0MEG               7.0 MOhm
// 6P5MEG               6.5 MOhm
// 6P0MEG               6.0 MOhm
//
#define DDI_0_OSC_LFOSCCTL_RCOSCLF_RTUNE_TRIM_M                     0x00000300
#define DDI_0_OSC_LFOSCCTL_RCOSCLF_RTUNE_TRIM_S                     8
#define DDI_0_OSC_LFOSCCTL_RCOSCLF_RTUNE_TRIM_7P5MEG                0x00000000
#define DDI_0_OSC_LFOSCCTL_RCOSCLF_RTUNE_TRIM_7P0MEG                0x00000100
#define DDI_0_OSC_LFOSCCTL_RCOSCLF_RTUNE_TRIM_6P5MEG                0x00000200
#define DDI_0_OSC_LFOSCCTL_RCOSCLF_RTUNE_TRIM_6P0MEG                0x00000300

// Field: [7:0] RCOSCLF_CTUNE_TRIM
//
// Trim bits to tune the capacitance in the RC 32 kHz osc.
//
//
#define DDI_0_OSC_LFOSCCTL_RCOSCLF_CTUNE_TRIM_M                     0x000000FF
#define DDI_0_OSC_LFOSCCTL_RCOSCLF_CTUNE_TRIM_S                     0

//*****************************************************************************
//
// Register: DDI_0_OSC_O_RCOSCHFCTL
//
//*****************************************************************************
// Field: [15:8] RCOSCHF_CTRIM
//
// Capacitor Trim for RCOSC HF. The code 0xC0 gives the lowest frequency.
// The analog module inverts the two MSBs of this bit field internally.
//
// 1100000000: Min freq
// 0011111111: Max freq
//
#define DDI_0_OSC_RCOSCHFCTL_RCOSCHF_CTRIM_M                        0x0000FF00
#define DDI_0_OSC_RCOSCHFCTL_RCOSCHF_CTRIM_S                        8

// Field: [7]    SPARE7
//
// Software should not rely on the value of a reserved. Writing any other value
// than the reset value may result in undefined behavior
#define DDI_0_OSC_RCOSCHFCTL_SPARE7                                 0x00000080
#define DDI_0_OSC_RCOSCHFCTL_SPARE7_BITN                            7
#define DDI_0_OSC_RCOSCHFCTL_SPARE7_M                               0x00000080
#define DDI_0_OSC_RCOSCHFCTL_SPARE7_S                               7

// Field: [6]    ATEST_VDD_LOCAL_SEL
//
// Selects source of VDD_LOCAL - before or after the buffer
//
// 0: Selects buffered VDD_LOCAL
// 1: Selects unbuffered VDD_LOCAL directly from replica inverter
#define DDI_0_OSC_RCOSCHFCTL_ATEST_VDD_LOCAL_SEL                    0x00000040
#define DDI_0_OSC_RCOSCHFCTL_ATEST_VDD_LOCAL_SEL_BITN               6
#define DDI_0_OSC_RCOSCHFCTL_ATEST_VDD_LOCAL_SEL_M                  0x00000040
#define DDI_0_OSC_RCOSCHFCTL_ATEST_VDD_LOCAL_SEL_S                  6

// Field: [5]    RCOSCHF_ATEST_EN
//
// Enables ATEST outputs of RCOSC_HF.
//
// 0: RCOSC_HF does not drive ATEST signals.
// 1: RCOSC_HF_CLK drives ATEST1 and ATEST0 output is controlled by
// ATEST_VDD_LOCAL_SEL
//
// This enable causes the RCOSC_HF to drive the signals that go to a mux
// controlled by ATESTCTL.ATEST_OSC_HF_SEL.
// To drive these signals further on to the ATEST outputs, that mux must be
// programmed to select these inputs.
//
#define DDI_0_OSC_RCOSCHFCTL_RCOSCHF_ATEST_EN                       0x00000020
#define DDI_0_OSC_RCOSCHFCTL_RCOSCHF_ATEST_EN_BITN                  5
#define DDI_0_OSC_RCOSCHFCTL_RCOSCHF_ATEST_EN_M                     0x00000020
#define DDI_0_OSC_RCOSCHFCTL_RCOSCHF_ATEST_EN_S                     5

// Field: [3:0] RCOSCHF_ITUNE_TRIM
//
// Trim bias current used in local inverter in 500nA steps.
//
// This field uses a 2's complement encoding.
// 1000: 2.000 uA
// 1111: 5.500 uA
// 0000: 6.000 uA (default)
// 0001: 6.500 uA
// 0111: 9.500 uA
//
// Trims rcosc_hf vdd local regulator.
#define DDI_0_OSC_RCOSCHFCTL_RCOSCHF_ITUNE_TRIM_M                   0x0000000F
#define DDI_0_OSC_RCOSCHFCTL_RCOSCHF_ITUNE_TRIM_S                   0

//*****************************************************************************
//
// Register: DDI_0_OSC_O_STAT0
//
//*****************************************************************************
// Field: [30:29] SCLK_LF_SRC
//
// Indicates source for the sclk_lf
//
// 00: rcosc_hf_dlf
// 01: xosc_hf_dlf
// 10: rcosc_lf
// 11: xosc_lf
#define DDI_0_OSC_STAT0_SCLK_LF_SRC_M                               0x60000000
#define DDI_0_OSC_STAT0_SCLK_LF_SRC_S                               29

