GComPI-IFPB/openmote-fw/platform/cc2650/inc/hw_ddi_0_osc.h
// Field: [28]    SCLK_HF_SRC
//
// Indicates source for the sclk_hf
//
// 0: rcosc_hf
// 1: xosc_hf
#define DDI_0_OSC_STAT0_SCLK_HF_SRC                                 0x10000000
#define DDI_0_OSC_STAT0_SCLK_HF_SRC_BITN                            28
#define DDI_0_OSC_STAT0_SCLK_HF_SRC_M                               0x10000000
#define DDI_0_OSC_STAT0_SCLK_HF_SRC_S                               28

// Field: [27]    BYPASS_OSCDIG
//
// indicates that OSC_DIG  is bypassed
#define DDI_0_OSC_STAT0_BYPASS_OSCDIG                               0x08000000
#define DDI_0_OSC_STAT0_BYPASS_OSCDIG_BITN                          27
#define DDI_0_OSC_STAT0_BYPASS_OSCDIG_M                             0x08000000
#define DDI_0_OSC_STAT0_BYPASS_OSCDIG_S                             27

// Field: [26]    BGAP_NEEDED
//
// bgap_needed request from OSC_DIG
#define DDI_0_OSC_STAT0_BGAP_NEEDED                                 0x04000000
#define DDI_0_OSC_STAT0_BGAP_NEEDED_BITN                            26
#define DDI_0_OSC_STAT0_BGAP_NEEDED_M                               0x04000000
#define DDI_0_OSC_STAT0_BGAP_NEEDED_S                               26

// Field: [25]    BGAP_RDY
//
// bgap_rdy -- input
#define DDI_0_OSC_STAT0_BGAP_RDY                                    0x02000000
#define DDI_0_OSC_STAT0_BGAP_RDY_BITN                               25
#define DDI_0_OSC_STAT0_BGAP_RDY_M                                  0x02000000
#define DDI_0_OSC_STAT0_BGAP_RDY_S                                  25

// Field: [24]    GBIAS_NEEDED
//
// gbias_needed request from OSC_DIG
#define DDI_0_OSC_STAT0_GBIAS_NEEDED                                0x01000000
#define DDI_0_OSC_STAT0_GBIAS_NEEDED_BITN                           24
#define DDI_0_OSC_STAT0_GBIAS_NEEDED_M                              0x01000000
#define DDI_0_OSC_STAT0_GBIAS_NEEDED_S                              24

// Field: [23]    GBIAS_RDY
//
// gbias_rdy -- input
#define DDI_0_OSC_STAT0_GBIAS_RDY                                   0x00800000
#define DDI_0_OSC_STAT0_GBIAS_RDY_BITN                              23
#define DDI_0_OSC_STAT0_GBIAS_RDY_M                                 0x00800000
#define DDI_0_OSC_STAT0_GBIAS_RDY_S                                 23

// Field: [22]    RCOSC_HF_EN
//
// RCOSC_HF_EN
#define DDI_0_OSC_STAT0_RCOSC_HF_EN                                 0x00400000
#define DDI_0_OSC_STAT0_RCOSC_HF_EN_BITN                            22
#define DDI_0_OSC_STAT0_RCOSC_HF_EN_M                               0x00400000
#define DDI_0_OSC_STAT0_RCOSC_HF_EN_S                               22

// Field: [21]    RCOSC_LF_EN
//
// RCOSC_LF_EN
#define DDI_0_OSC_STAT0_RCOSC_LF_EN                                 0x00200000
#define DDI_0_OSC_STAT0_RCOSC_LF_EN_BITN                            21
#define DDI_0_OSC_STAT0_RCOSC_LF_EN_M                               0x00200000
#define DDI_0_OSC_STAT0_RCOSC_LF_EN_S                               21

// Field: [20]    XOSC_LF_EN
//
// XOSC_LF_EN
#define DDI_0_OSC_STAT0_XOSC_LF_EN                                  0x00100000
#define DDI_0_OSC_STAT0_XOSC_LF_EN_BITN                             20
#define DDI_0_OSC_STAT0_XOSC_LF_EN_M                                0x00100000
#define DDI_0_OSC_STAT0_XOSC_LF_EN_S                                20

// Field: [19]    CLK_DCDC_RDY
//
// CLK_DCDC_RDY
#define DDI_0_OSC_STAT0_CLK_DCDC_RDY                                0x00080000
#define DDI_0_OSC_STAT0_CLK_DCDC_RDY_BITN                           19
#define DDI_0_OSC_STAT0_CLK_DCDC_RDY_M                              0x00080000
#define DDI_0_OSC_STAT0_CLK_DCDC_RDY_S                              19

// Field: [18]    CLK_DCDC_RDY_ACK
//
// CLK_DCDC_RDY_ACK
#define DDI_0_OSC_STAT0_CLK_DCDC_RDY_ACK                            0x00040000
#define DDI_0_OSC_STAT0_CLK_DCDC_RDY_ACK_BITN                       18
#define DDI_0_OSC_STAT0_CLK_DCDC_RDY_ACK_M                          0x00040000
#define DDI_0_OSC_STAT0_CLK_DCDC_RDY_ACK_S                          18

// Field: [17]    SCLK_HF_LOSS
//
// Indicates sclk_hf is lost
#define DDI_0_OSC_STAT0_SCLK_HF_LOSS                                0x00020000
#define DDI_0_OSC_STAT0_SCLK_HF_LOSS_BITN                           17
#define DDI_0_OSC_STAT0_SCLK_HF_LOSS_M                              0x00020000
#define DDI_0_OSC_STAT0_SCLK_HF_LOSS_S                              17

// Field: [16]    SCLK_LF_LOSS
//
// Indicates sclk_lf is lost
#define DDI_0_OSC_STAT0_SCLK_LF_LOSS                                0x00010000
#define DDI_0_OSC_STAT0_SCLK_LF_LOSS_BITN                           16
#define DDI_0_OSC_STAT0_SCLK_LF_LOSS_M                              0x00010000
#define DDI_0_OSC_STAT0_SCLK_LF_LOSS_S                              16

// Field: [15]    XOSC_HF_EN
//
// Indicates that XOSC_HF is enable if not BAW Mode. Else indicates BAW is active.
#define DDI_0_OSC_STAT0_XOSC_HF_EN                                  0x00008000
#define DDI_0_OSC_STAT0_XOSC_HF_EN_BITN                             15
#define DDI_0_OSC_STAT0_XOSC_HF_EN_M                                0x00008000
#define DDI_0_OSC_STAT0_XOSC_HF_EN_S                                15

// Field: [14]    XOSC_HF_PEAK_DET_EN
//
// XOSC_HF_PEAK_DET_EN
#define DDI_0_OSC_STAT0_XOSC_HF_PEAK_DET_EN                         0x00004000
#define DDI_0_OSC_STAT0_XOSC_HF_PEAK_DET_EN_BITN                    14
#define DDI_0_OSC_STAT0_XOSC_HF_PEAK_DET_EN_M                       0x00004000
#define DDI_0_OSC_STAT0_XOSC_HF_PEAK_DET_EN_S                       14

// Field: [13]    XB_48M_CLK_EN
//
// Indicates that the 48MHz clock from the BAW or DOUBLER is enabled.
// If not in BAW Mode, indicates the DOUBLER is enabled. It will be enabled if
// 24 or 48 MHz chrystal is used (enabled in doulbler bypass for the 48MHz
// chrystal).
// If BAW Mode indicates that the 48MHz BAW clock is being used for a 48MHz
// clock source (SCLK_HF or CLK_DCDC).
//
//
#define DDI_0_OSC_STAT0_XB_48M_CLK_EN                               0x00002000
#define DDI_0_OSC_STAT0_XB_48M_CLK_EN_BITN                          13
#define DDI_0_OSC_STAT0_XB_48M_CLK_EN_M                             0x00002000
#define DDI_0_OSC_STAT0_XB_48M_CLK_EN_S                             13

